In [10]:
import pandas as pd

In [11]:
import numpy as np

In [12]:
#AGGREGATE function is a fun that takes in many values and gives a single output

In [15]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [16]:
df = pd.DataFrame(data)

In [30]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [42]:
group_by_Comp = df.groupby('Company')

In [43]:
group_by_Comp

In [44]:
group_by_Comp.sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [45]:
group_by_Comp.sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [47]:
#ALL IN ONE LINE
df.groupby('Company').sum().loc['GOOG']

Person    SamCharlie
Sales            320
Name: GOOG, dtype: object

In [48]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [51]:
df.groupby('Company').max()#this is done on the basis of alphabetical order

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [52]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [56]:
df.groupby('Company').describe().transpose()['MSFT']

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: MSFT, dtype: float64